---
kind: other
id: Properties.T:Autodesk.Revit.DB.Surface
source: html/35725346-816c-13e2-4f21-0d820daa4d58.htm
---
# Surface Properties

Specifies whether the .NET object represents a valid Revit entity.